/*
 * Присвоение по ссылке и по значению
 */

/*
 * Примитивы: строки, числа, були, null и undefined, при присваивании копируются целиком, по значению (by value).
 */

/*
 * Со сложными типами всё не так. В переменной, которой присвоен массив или объект, хранится не само значение, а адрес его места в памяти, иными словами - ссылка (указатель) на него и передаются они по ссылке (by reference).
 */

// let a = 5;
// /*
//  * Присвоение по значению, в памяти будет создана еще одна ячейка в которую будет скопировано значение 5
//  */
// let b = a;
// console.log(a); // 5
// console.log(b); // 5

// // Изменим значение a
// a = 10;
// console.log(a); // 10
// // Значение b не изменилось так как это отдельная копия
// console.log(b); // 5

/*
 * Сложные типы - объекты, массивы, функции присваиваются по ссылке, то есть переменная просто получает ссылку на уже существующий объект.
 */
const a = ['Mango'];
// Так как a это массив, в b записывается ссылка на уже существующий массив в памяти. Теперь a и b указывают на один и тот же массив.
const b = a;
console.log(a); // ['Mango']
console.log(b); // ['Mango']

// Изменим массив, добавив еще один элемент, используя указатель из a

a.push('Poly');
console.log(a); // ['Mango', 'Poly']

// b также изменилось, потому что b, как и a, просто содержит ссылку на одно и то же место в памяти
console.log(b); // ['Mango', 'Poly']

// Результат повторяется
b.push('Ajax');

console.log(a); // ['Mango', 'Poly', 'Ajax']
console.log(b); // ['Mango', 'Poly', 'Ajax']
